const groupsArr: any = [
  {
    name: "TWICE",
    code: "TW",
    mbti: "INFP",
    fitMe: {
      INFP: 2,
      ENFP: 2,
      INFJ: 2, 
      ENFJ: 1,
      INTJ: 2,
      ENTJ: 1,
      INTP: 2,
      ENTP: 2,
      ISFP: 5,
      ESFP: 5,
      ISTP: 5,
      ESTP: 5,
      ISFJ: 5,
      ESFJ: 5,
      ISTJ: 5,
      ESTJ: 5
    },
    member: [
      {
        name: "Nayeon",
        mbti: "ISTP"
      },
      {
        name: "Jeongyeon",
        mbti: "ISFJ"
      },
      {
        name: "Momo",
        mbti: "INFP"
      },
      {
        name: "Sana",
        mbti: "ENFP"
      },
      {
        name: "Jihyo",
        mbti: "ISFP"
      },
      {
        name: "Mina",
        mbti: "ISFP"
      }, 
      {
        name: "Dahyun",
        mbti: "ISFJ"
      },
      {
        name: "Chaeyoung",
        mbti: "INFP"
      },
      {
        name: "Tzuyu",
        mbti: "ISFP"
      },               
    ],
    albumCover: 16,
    slogan: "사랑을 찾기 위해, 영원을 약속하는 순정파 걸그룹",
    percent: 12,
    description: [
      `트와이스 노래는 드라마나 영화에 등장하는 소개팅 직전의 주인공을 연상시킵니다. 거울 앞에 서서 이렇게 말할까, 저렇게 말할까를 고민하는 전형적인 씬 말입니다. "여자가 쉽게 맘을 주면 안 된다"던 트와이스는 어느덧 알콜프리에도 취할 만큼 과감해졌습니다. 그러나 여전히 트와이스 노래의 가사는 상대와의 적극적인 대화보다는 좀 귀여운 독백같은 느낌을 줍니다.`,
      `트와이스 타입은 몽상가이자 이상주의자입니다. "머릿속에 영화 속 같은 장면들이 지나"가는 이들은 책이나 영화 속 인물에 매료되는 일이 종종 있습니다. 이들의 머릿속에서는 늘 현실에서 만큼 많은 일이 벌어집니다. 트와이스 노래 속 주인공들은 사랑의 현장에 있더라도 혼자서 무언가를 상상하거나, 자신의 마음이 왜 이런지 궁금해하고, 또 새로운 다짐을 하느라 바쁩니다. 트와이스 노래 가사에서는 의외로 "네가 너무 멋있어!"라는 달콤한 칭찬도 찾기 힘들죠. (트와이스는 <more&more>와 <I can't stop me>에 이르러서야 현실에 스스로를 내던지고, 열다여섯 곡이 넘는 히트곡을 내고야 <Cry for me>에서 처음 이별을 겪습니다.)`,
      `트와이스 타입의 사람들은 상상만 할 뿐 사랑을 쟁취하는 데에 굉장히 소극적인 듯 보입니다. 그러나 이들도 나름대로 마음을 어필하기 위해 꾸준히 실천을 합니다. 시그널도 보내고 안읽씹도 해보고 상태메시지도 랄랄라로 바꾸죠. 이들의 실천이 더딘 것은 생각해야 할 것들이 너무 많기 때문입니다. 인사를 건네자니 "난 쯔위라고 무작정 인사하는 게 좋을지 쪽지 주고 도망치는 게 좋을지" 고민이 들고, 좋아요를 한 번 누르려해도, "너무 뻔한 게 내 맘 표현하기엔 부족한 것 같고, 내 맘 니가 몰라야만 하는데" 고민이 듭니다. 그러다보니 이러지도 못하는데 저러지도 못하게 되는 것입니다. 물론 이들 역시 확신이 들 때면 상대에게 "yes or yes"를 제안하기도 합니다. 물론 그 와중에도, "헐, 나 이렇게 이기적이었나?" 혼자 되뇌이는 트와이스적 모먼트를 선사하지만요.`,
      `트와이스 타입의 사람들은 이타적이고 다른 사람들을 많이 신경씁니다. 이들은 자존심을 세우며 다른 사람들의 반응을 애써 무시하기보다는 "아무 반응 없는 너 땜에 삐져서 집콕하다, 니가 연락 한 번 해주자, 곧 울다가도 다시 신나서 춤추"는 모습도 꾸밈없이 드러냅니다. 게으르면서도 소심한 관종인 이들은 "멋 부린다는 거 정말 귀찮지만 절대 대충할 수가 없습니다." 이렇게 남들을 충분히 생각하면서도, 창의적이며 개성적인 이들은 조금 소극적임에도 어디서든 확실한 존재감을 확보합니다.`
    ]
  },
  {
    name: "APRIL",
    code: "APR",
    mbti: "ENFP",
    fitMe: {
      INFP: 2,
      ENFP: 2,
      INFJ: 1, 
      ENFJ: 2,
      INTJ: 1,
      ENTJ: 2,
      INTP: 2,
      ENTP: 2,
      ISFP: 5,
      ESFP: 5,
      ISTP: 5,
      ESTP: 5,
      ISFJ: 5,
      ESFJ: 5,
      ISTJ: 5,
      ESTJ: 5 
    },
    member: [
      {
        name: "Chaekyung",
        mbti: "ESFP"
      },
      {
        name: "Chaewon",
        mbti: "ISFJ"
      },
      {
        name: "Naeun",
        mbti: "INFP"
      },
      {
        name: "Yena",
        mbti: "ISFJ"
      },
      {
        name: "Rachel",
        mbti: "Unknown"
      },
      {
        name: "Jinsol",
        mbti: "ENFJ"
      },
    ],
    albumCover: 11,
    slogan: "사랑을 찾기 위해, 영원을 약속하는 순정파 걸그룹",
    percent: 12,
    description: [
      `에이프릴의 노래와 가장 어울리는 장소를 꼽으면 테마파크가 아닐까요. 데뷔동기들에 비해 비교적 어린 나이의 멤버들로 구성된 에이프릴의 노래들은 대체로 좀 들떠있거나 동화 속 이야기 같습니다. 늙지 않는 피터팬의 단짝, 별처럼 빛나는 팅커벨을 자처하는 에이프릴 타입의 사람들은 종종 몽상가라고 불리곤 합니다. 이들은 세상에 대한 호기심이 많고, 천진한 매력이 있죠. 사랑에 빠진 이들은 "두근 대는 가슴 안고 어린 아이처럼 나도 모르게 널 그리"게 됩니다. 종종 "do it chu, 어린 애 아냐!"라고 투정부리기도 하지만, 과연 어린 아이가 아니라면 저런 투정이 가능할까 싶네요.`,
      `아이처럼 인생을 즐겁게 사는 이들은 세상을 아름답게 보려는 경향이 있는데, 이 때문인지 이들은 사람들을 끌어당기는 매력이 있습니다. "원래 나비들은 예쁜 꽃을 보면 앉고 싶어하는 법!"  이들 역시 사람들의 관심을 부담스러워하기보다는 즐깁니다. 모모랜드 타입 역시 에이프릴 타입처럼 발랄한 텐션을 유지하고 즐거움을 찾지만 이 둘의 결정적인 차이는 에이프릴 타입의 경우, 사람들과 유대관계를 맺으면서 그 안에서 즐거움을 찾는다는 점입니다. "우리를 감싸는 이 공기를 느껴봐, 설레는 지금을 나와 함께 즐겨봐 즐겨봐!", "꿈 속에 그리던 달콤한 널 안을 때 온 세상이 아름답게 펼쳐져."라는 걸 보면 이들은 대체로 다른 누군가와 함께 즐거움을 느끼길 원한다는 걸 알 수 있습니다.`,
      `그러나 아이러니하게도 이들은 혼자있는 시간을 필요로 합니다. 이들은 남들 앞에서 쉽게 드러내지 않는 우울한 감정을 마음 한 구석에 담고 있습니다. <봄의 나라 이야기>는 언뜻보면 마냥 천진한 동화 제목 같지만, 내용을 살피면 얼음나라 멋진 소년을 짝사랑하며 가슴 아파하는 봄의 나라 소녀 이야기입니다. "항상 혼자만 앓아요", "아름다운 맘 억지로 숨기고"라는 부분에서 에이프릴 타입이 혼자일 때의 모습을 유추해볼 수 있습니다. 그러나 그런 마음 역시 "별들의 숫자만큼만 나를 떠올려줄래, 더 많이 사랑해줄게, 넌 내 꿈만 꿔"라고 말해주는 누군가가 있다면 금방 해소되는 게 에이프릴 타입입니다.`
    ]
  },
  {
    name: "GFRIEND",
    code: "GF",
    mbti: "INFJ",
    fitMe: {
      INFP: 2,
      ENFP: 1,
      INFJ: 2, 
      ENFJ: 2,
      INTJ: 2,
      ENTJ: 2,
      INTP: 2,
      ENTP: 1,
      ISFP: 5,
      ESFP: 5,
      ISTP: 5,
      ESTP: 5,
      ISFJ: 5,
      ESFJ: 5,
      ISTJ: 5,
      ESTJ: 5
    },
    member: [
      {
        name: "Sowon",
        mbti: "INFP"
      },
      {
        name: "Yerin",
        mbti: "ENFJ"
      },
      {
        name: "Eunha",
        mbti: "ISTP"
      },
      {
        name: "Yuju",
        mbti: "ENFJ"
      },
      {
        name: "SinB",
        mbti: "ISFJ"
      },
      {
        name: "Umji",
        mbti: "INFJ"
      },
    ],
    albumCover: 14,
    slogan: "사랑을 찾기 위해, 영원을 약속하는 순정파 걸그룹",
    percent: 12,
    description: [
      `그토록 꾸준히 "영원"을 약속해왔거늘... 이렇게 갑작스런 해체라니! 먼저 심심한 위로를 전합니다. 여자친구가 계승한 소녀시대의 다만세 중 여자친구에게 어울리는 단 한 줄을 꼽으라면 "언제까지라도 함께 하는 거야!"를 꼽겠습니다. "영원"과 "미래"는 여자친구 노래의 단골 소재입니다. "언제까지나", "언제라도" 네 곁에서 변치 않을 것을 약속하는 여자친구! 여자친구 타입은 영원과 이상, 자신만의 가치를 쫓는 타입입니다. 마치 변치 않는 진리를 탐구하는 철학자처럼요! 이는 "파워청순(여자친구의 초기 컨셉)" 컨셉에 국한 되는 이야기가 아닙니다. "모던위치"로 컨셉변화를 꾀하며 "투명했던 유리구슬이 붉게 빛나고", "수줍은 아이는 놓았지만" 여전히 "영원한 마녀들의 밤"을 기약하고 있습니다.`,
      `여자친구 타입의 사람들은 사실이나 논리에 입각한 딱딱한 대화보다는 예민하고 섬세한 언어에 익숙합니다. 여자친구의 노래를 살피면 "유리구슬처럼", "이슬처럼", "평행선처럼", "나비처럼" 등 비유가 끊임없이 등장하는 것을 알 수 있습니다. 더 나아가 이들은 때로 비언어적인 소통을 추구하기도 합니다. "말로 표현할 수 없는 것이 눈빛으로 느껴지기도 하고, 심장소리에 그대 마음이 전해지기"도 하죠.`,
      `섬세한 언어를 통해 저 너머의 무언가를 쫓는 이들에게는 반전매력이 있습니다. 여자친구타입은 청순하면서도 파워풀하고 아련하면서도 격정적입니다. "유리구슬 같이보여도 절대 깨지지 않죠." 여자친구 타입은 가만히 앉아 이상을 꿈꾸기만하는 것이 아닙니다. 이들은 이상향을 꿈꾸는데 있어 거침이 없습니다. 여자친구는 닿을 수 없는 '너'에게 기어코 닿기 위해 널 기억해내고, 널 찾아냅니다. 여자친구의 무대만 보더라도 이들이 얼마나 열심인지 굳이 여러 마디 말이 필요가 없겠네요.`,
      `의미와 깊이를 탐색하는 이들은 비현실적인 기대를 갖기도 합니다. 데뷔초부터 널 만나겠다고 다짐했던 여자친구는 2020년이 되어 교차로에 섰지만 여전히 "아직 어디도 못 간 채로, 널 찾겠다"고 다짐하고 있습니다. 여자친구는 사랑하는 사람을 만난 그 순간보다는, 사랑하는 사람을 기다리고 그리워하는 데에 집중합니다. 여자친구같은 친구를 주변에 두고 있다면, 그냥 적당한 사람 만나라고 이야기해주고 싶을지도 모릅니다. 그러나 이들이 진실하고 깊은 사랑을 적당한 현실과 타협하는 일은 그리 흔치 않을 것입니다.`
    ]
  },
  {
    name: "IZ*ONE",
    code: "IZ",
    mbti: "ENFJ",
    fitMe: {
      INFP: 1,
      ENFP: 2,
      INFJ: 2, 
      ENFJ: 2,
      INTJ: 2,
      ENTJ: 2,
      INTP: 2,
      ENTP: 2,
      ISFP: 1,
      ESFP: 5,
      ISTP: 5,
      ESTP: 5,
      ISFJ: 5,
      ESFJ: 5,
      ISTJ: 5,
      ESTJ: 5
    },
    member: [
      {
        name: "Eunbi",
        mbti: "ENFP"
      },
      {
        name: "Sakura",
        mbti: "Unknown"
      },
      {
        name: "Hyewon",
        mbti: "ESFP"
      },
      {
        name: "Yena",
        mbti: "Unknown"
      },
      {
        name: "Chaeyeon",
        mbti: "ENFJ"
      },
      {
        name: "Chaewon",
        mbti: "Unknown"
      },
      {
        name: "Minju",
        mbti: "INFJ"
      },
      {
        name: "Nako",
        mbti: "ISFJ"
      },
      {
        name: "Hitomi",
        mbti: "Unknown"
      },
      {
        name: "Yuri",
        mbti: "Unknown"
      },
      {
        name: "Yujin",
        mbti: "Unknown"
      },
      {
        name: "Wonyoung",
        mbti: "Unknown"
      },
    ],
    albumCover: 5,
    slogan: "사랑을 찾기 위해, 영원을 약속하는 순정파 걸그룹",
    percent: 12,
    description: [
      `아이즈원을 탄생시킨 프로그램 <프로듀스48>부터 본격적인 아이즈원 활동까지. 아이즈원의 알파와 오메가를 관통하는 키워드는 바로 "성장드라마"입니다. 아이즈원 타입의 사람들은 주변사람들의 성장을 도모하며 기쁨을 느낍니다. 아이즈원 노래 가사를 살피면 긍정적인 변화를 위해 무언가 시도하기를 권유하는 가사가 많습니다. "감았던 눈을 떠봐", "널 세상에 펼쳐봐", "더 뛰어올라, 더 소리쳐봐". 이제 막 사회에 발을 내딛은 새내기들을 위한 대학잡지 캐치프레이즈들을 연상시킵니다. 아이즈원의 노래를 물론 사랑 노래라고 들을 수도 있겠지만, 여자친구의 노래를 "우정"의 관점에서 해석해볼 수 있듯이 이들의 노래 역시 자아의 성장을 도모하는 자신과의 대화라고 들어도 큰 무리가 없습니다. "내 안의 나를 천천히 안아주면"과 같은 가사들은 특히 더 그렇습니다.`,
      `유독 "지금", "이 순간"이 많이 등장하는 아이즈원 가사를 통해, 아이즈원 타입의 사람들에게 현실적인 면모가 보인다고 해석해볼 수도 있지만, 사실 아이즈원이 이야기하는 "지금"과 "이 순간"은 언제나 "바래오고 기다려왔던 그 순간"입니다. 아이즈원 타입은 현재를 즐기기도 하지만, 이들은 머릿속으로 언제나 더 이상적인 모습의 나와 공동체를 상상합니다. "상상해봐 너의 la vie en rose"라던지, "너와 같은 꿈을 꾸는 꿈 꿀래, 우리 바래왔던 곳으로 갈래!", "매일 그려왔던 내 모습 가까이, 우예~" 등이 그 예시죠. 이들은 잠재력과 가능성을 발견하는데 놀라운 능력을 갖고 있습니다.`,
      `아이즈원 타입은 꿈을 꾸는데서 그치지 않고 이를 실현시키기 위해 부단히 노력합니다. "내가 언제든 깨어날 수 있게 불러줄테니, 넌 빨갛게 칠해봐!", "이건 신기루가 아냐!", "상상했던 모든 순간들이 눈앞에 다가올 때까지!" 등 언제나 너와 나의 이상과 꿈을 실현하기위해 노력합니다. 그리고 노력의 과정에서 아이즈원 타입의 사람들은 주로 전폭적인 서포터가 됩니다. 이들에게는 타인의 신뢰가 원동력이 됩니다. 아이즈원 타입은 종종 다른 사람들에게 "너너너 나를 믿어줄래"라고 요청하며, "오직 너를 위한 나니까", "지켜줄게, 비춰줄게"라고 확신을 줍니다.`,
      `"무지개 집으로", "나의 모든 계절 모두 화려한 이 축제로" 사람들을 초대하는 아이즈원 타입의 사람들은 게스트 보다는 호스트에 익숙하며, 이들은 탁월한 리더입니다. 그러나 이들이 더 좋은 리더가 되기 위해 보완해야할 점들이 있습니다. 이들은 타인을 열성적으로 돕고자 하는 만큼 타인의 반응에 예민합니다. 지나치게 타인의 시선을 신경쓰는 나머지, 좀 우유부단한 모습을 보일 때도 있으며, 정 때문에 일을 그르치기도 합니다. 타인을 너무 쉽게 믿어버리거나, 남들에게 너무 많이 감정이입을 하기도 하죠.`
    ]
  },
  {
    name: "ITZY",
    code: "ITZY",
    mbti: "INTJ",
    fitMe: {
      INFP: 2,
      ENFP: 1,
      INFJ: 2, 
      ENFJ: 2,
      INTJ: 2,
      ENTJ: 2,
      INTP: 2,
      ENTP: 1,
      ISFP: 3,
      ESFP: 3,
      ISTP: 3,
      ESTP: 3,
      ISFJ: 4,
      ESFJ: 4,
      ISTJ: 4,
      ESTJ: 4
    },
    member: [
      {
        name: "Yeji",
        mbti: "ISFJ"
      },
      {
        name: "Lia",
        mbti: "ENFJ"
      },
      {
        name: "Ryujin",
        mbti: "INTJ"
      },
      {
        name: "Chaeryeong",
        mbti: "ESFJ"
      },
      {
        name: "Yuna",
        mbti: "ENFJ"
      },
    ],
    albumCover: 5,
    slogan: "사랑을 찾기 위해, 영원을 약속하는 순정파 걸그룹",
    percent: 12,
    description: [
      `K팝 3세대 걸그룹들이 주구장창 사랑의 세레나데를 불러왔다면 4세대 아이돌들은 뭔가 다릅니다. 사랑에 그닥 큰 관심이 없는 그룹을 꼽으라면 당연히 에스파와 있지입니다. 있지 타입의 사람들은 "사랑따위에 목메지 않습니다. 세상에는 재밌는 것들이 더 많기" 때문이죠. 이들은 자신의 능력에 자신감이 있고 스스로를 높이 평가합니다. 이들에게 있어서 중요한 것은 독립과 자유입니다. "네 기준에 날 맞추려 하지만, 너의 틀에 날 맞출 맘은 없다"고 이야기합니다. 이들은 타인에게 잘보이고자 하는 욕구가 크지 않습니다. "차갑게 보여도 어쩔 수 없다. 원래 쿨하고 바꿀 맘이 없다"고 누차 말합니다. 이들은 모든 유형 중 가장 독립심이 강하고 냉철하며, 객관적입니다.`,
      `한국식 "사회생활"에 가장 취약한 타입 중 하나인 있지  타입. 이들에게 조직생활에 적응하기란 만만찮은 과제입니다. 흔한 꼰대들에게 있지는 당차게 "잔소리 Stop it"이라고 외칩니다. 사람들은 있지 유형을 때론 이기적이고 개인주의적이라고 욕하기도 하지만 어쩔 수 없습니다. 이들은 "착한척 하며 상처받기보다는 차라리 이기적이기"로 스스로 결정한 것입니다. 이들의 인생은 대체로 자기 "하고 싶은 일 하기도 바쁩"니다. 그러니 이들은 "맘대로 하게 말리지 않는 편"이 좋겠습니다. 있지 타입의 사람들은 언제나 일관된 모습을 보여줍니다. 상투적인 잡담이나 가십, 뒷담화에 대해서도 관심이 없고, "남 말하기를 좋아하는 사람들"도 이해하지 못합니다. 이들을 주변에 두고 있다면, 가끔 냉정한 모습에 서운함을 느낄 순 있어도, 배신감이나 어딘지 모를 찝찝한 기분을 느낄 필요는 없을 것입니다.`,
      `때론 칼같아 보이는 있지 타입의 사람들도 당연하게도 연애감정을 느낍니다. 이들은 연애에 있어서도 명확한 목표화 계획을 갖고 임합니다. 때때로 애정의 예측 불가능성을 잊는 경향이 있죠. 이들은 심지어 N성향을 갖고 있기 때문에 머릿속에 특정한 이상향을 갖고 있습니다. 순간을 즐기기보다는 계획하고 생각하는데 더 많은 시간을 보냅니다. "전혀 안보이겠지만, 이들에겐 다 계획이 있습니다." 이 계획을 갖고, "작전을 개시"하죠. 이들은 사랑에서 겪는 어려움을 극복하기 위해 때때로 자신의 지적 우월성을 어필하기도 합니다.`
    ]
  },
  {
    name: "MAMAMOO",
    code: "MMM",
    mbti: "ENTJ",
    fitMe: {
      INFP: 1,
      ENFP: 2,
      INFJ: 2, 
      ENFJ: 2,
      INTJ: 2,
      ENTJ: 2,
      INTP: 1,
      ENTP: 2,
      ISFP: 3,
      ESFP: 3,
      ISTP: 3,
      ESTP: 3,
      ISFJ: 3,
      ESFJ: 3,
      ISTJ: 3,
      ESTJ: 3
    },
    member: [
      {
        name: "Solar",
        mbti: "INFJ"
      },
      {
        name: "Moonbyul",
        mbti: "ENFP"
      },
      {
        name: "Wheein",
        mbti: "INTP"
      },
      {
        name: "Hwasa",
        mbti: "ENFP"
      }
    ],
    albumCover: 14,
    slogan: "사랑을 찾기 위해, 영원을 약속하는 순정파 걸그룹",
    percent: 12,
    description: [
      `K팝 걸그룹 멘탈 최강자를 꼽자면 마마무가 아닐까요. 구체적으로 살필 것도 없이 "날 자극한 여러분 감사, 덕분에 나의 멘탈은 단단"하다고 스스로 말해주는 게 마마무입니다. 마마무 유형은 자존감이 높고 자신을 어필하는데 탁월한 능력을 갖고 있습니. "나로 말할 것 같으면 ~"이라는 문구 하나로 3분가량의 노래를 꽉꽉 채우고, "코 묻은 티 삐져나온 입, 떡진 머리" 어쩌구 하는 노래 가사에 떡하니 HIP이라는 제목을 붙여놓습니다. "내가 원래 좀 예뻐" 정도의 자기어필과는 차원이 다릅니다. 이들은 건방지다는 피드백에도, "Yes, I am, 아주 건방져", 라며 게의치 않아 합니다.`,
      `이들이 이렇게 높은 자존감을 유지할 수 있는 건 마마무 유형의 강한 성취욕 덕분입니다. 이들은 "누구보다 빠른 걸음을 걸어 성공을 썰어 먹"고자 하죠. 실제로 마마무는 실력있는 아이돌로 명망이 높습니다. 이들은 "이젠 모든 일이 가뿐하다"고 말할 수 있을 때까지 노력합니다. 이렇게 마마무 유형의 강한 성취욕은 이들의 자신감을 뒷받침할 만한 실력을 이끌어냈습니다. ("실력"을 지나치게 중시하는 이들은 간혹 실력없는 사람들을 이해하지 못하거나, "찌질이"라고 놀리기도 합니다;;)`,
      `마마무 타입은 사랑을 비롯한 인간관계도 일처럼 지나치게 이성적으로 접근할 때가 있습니다. 이들에게는 "사랑도 쟁취하는 것"입니다. 심지어 이들은 사랑에 마음 아파하다가도 "차갑게 머리가 식고나면, 너 없다고 무너질 내가 아님"을 빠르게 판단하고 "자기 앞길"을 챙긴다. 또한 사랑하는 관계에 있어서도 이들은 자신이 을이 되는 상황을 잘 견디지 못합니다. 그러니 "내가 널 좋아해서 네 주위를 맴돌아도 네가 태양은 아니"라며, 어찌보면 을인 와중에 "제멋대로 굴면 안 돼"라며 경고를 줍니다.`,
      `그럼에도 일에서라면 이들만큼 탁월하게 자신의 역량을 발휘하기도 함들 것입니다. 이들의 진취적인 태도와 냉철한 판단, 그리고 불도저같은 실천력 덕에 이들은 집단에서 리더를 맡는 경우가 많습니다. "자신 있으면 나를 따라해도 돼, 뒤따라와!"라고 말하는 이들은 집단을 이끌어 목표를 성취하는데에 큰 즐거움을 느낍니다. 그리고 약간의 관종력을 가진 이들은 "자신에게 던지는 팔로워들의 따끈따근한 관심"도 은근히 즐기는 경향이 있습니다.`
    ]
  },
  {
    name: "(G)I-DLE",
    code: "ID",
    mbti: "INTP",
    fitMe: {
      INFP: 2,
      ENFP: 2,
      INFJ: 2, 
      ENFJ: 2,
      INTJ: 2,
      ENTJ: 1,
      INTP: 2,
      ENTP: 2,
      ISFP: 3,
      ESFP: 3,
      ISTP: 3,
      ESTP: 3,
      ISFJ: 4,
      ESFJ: 4,
      ISTJ: 4,
      ESTJ: 1
    },
    member: [
      {
        name: "Soyeon",
        mbti: "INTP"
      },
      {
        name: "Miyeon",
        mbti: "ENFP"
      },
      {
        name: "Minnie",
        mbti: "ENFJ"
      },
      {
        name: "Yuqi",
        mbti: "ENFJ"
      },
      {
        name: "Shuhua",
        mbti: "Unknown"
      }
    ],
    albumCover: 9,
    slogan: "사랑을 찾기 위해, 영원을 약속하는 순정파 걸그룹",
    percent: 12,
    description: [
      `따지고 보면 특별하지 않은 사람은 없겠지만... 면밀히 살피지 않아도 뭔가 특별하다고 느껴지는 사람들이 있습니다. (여자)아이들 유형의 사람들이 그렇죠. 이들은 평범함을 거부합니다. (여자)아이들이 같은 세대 걸그룹 사이에서 대체불가한 컨셉을 유지하고 있음은 어렵지 않게 동의할 수 있을 거라 생각합니다. (여자)아이들의 노래는 청자의 성별을 좀처럼 드러내지도 않습니다. (여자)아이들 타입은 "쓸데없는 예의 따윈 물어뜯고, 편견이란 답답한 우리는 무너뜨"립니다. "뻔해빠진 꼰대들이 혀를 차도 게의치 않고, 기꺼이 아무도 가본 적이 없는 길을 개척"해냅니다.`,
      `(여자)아이들 타입의 사람들이 무작정 개썅마이웨이를 고집하는 것은 아닙니다. 이들은 대체로 뛰어난 사고력과 독창적 아이디어를 갖고 있습니다. 그러나 이들의 머릿속은 복잡하기 때문에 말로 표현하는 것에 종종 약한 모습을 보이곤 합니다. (여자)아이들의 가사는 유독 문장이 제대로 종결되지 않는 경우가 많죠. 그럼에도 그런 어색한 문장들을 엮어 강렬한 느낌을 전달합니다. 그런 전략은 조용하고 과묵하면서도 강렬한 인상을 주는 (여자)아이들 유형의 사람들과 닮아 있습니다. "어둠 속 Red Light, 시작의 점화", "불꽃처럼 강렬하고 데일 만큼 사랑하고", "뜨겁지 못한 날들에 홀로 데인 흉터를 큰 불을 내리오". 무슨 말인지 명확히 알아들을 순 없지만, (여자)아이들은 언제나 '불' 혹은 이성을 초월한 주술사와 같은 강렬한 이미지를 보여줍니다.`,
      `원한다면 기꺼이 사회화 불화하는 (여자)아이들 타입은 종종 부정적인 이미지로 비춰지곤합니다. 어둡고 우울한 인상을 주는데, 그도 그럴 것이, 이들은 우울을 즐길 수 있는 거의 유일한 타입입니다. 이들은 만화나 영화를 볼 때면 악당을 옹호하곤 합니다. "위험하니 갖고 싶고, 아픔까지 안고 싶은 것"이 (여자)아이들 타입입니다. 또한 이들은 비판적 사고 능력이 뛰어난데, 자신이 옳다고 생각했던 것이 부조리하게 부정당할 때 상대에게 의도적으로 큰 상처를 주기도 합니다. 이들은 감정적이면서도 냉정합니다. 사랑했던 인연도 필요하다면 "과감히 지울 수 있고, 그 흔적과 원망 역시도 훨훨 태워"버립니다.`
    ]
  },
  {
    name: "WekiMeki",
    code: "WM",
    mbti: "ENTP",
    fitMe: {
      INFP: 2,
      ENFP: 2,
      INFJ: 1, 
      ENFJ: 2,
      INTJ: 1,
      ENTJ: 2,
      INTP: 2,
      ENTP: 2,
      ISFP: 3,
      ESFP: 3,
      ISTP: 3,
      ESTP: 3,
      ISFJ: 4,
      ESFJ: 4,
      ISTJ: 4,
      ESTJ: 4
    },
    member: [
      {
        name: "Suyeon",
        mbti: "ISFJ"
      },
      {
        name: "Elly",
        mbti: "Unknown"
      },
      {
        name: "Yoojung",
        mbti: "ISFP"
      },
      {
        name: "Doyeon",
        mbti: "ESFP"
      },
      {
        name: "Sei",
        mbti: "Unknown"
      },
      {
        name: "Lua",
        mbti: "Unknown"
      },
      {
        name: "Rina",
        mbti: "Unknown"
      },
      {
        name: "Lucy",
        mbti: "Unknown"
      }
    ],
    albumCover: 9,
    slogan: "사랑을 찾기 위해, 영원을 약속하는 순정파 걸그룹",
    percent: 12,
    description: [
      `K팝이란 결국 동방예의지국의 노래인 만큼 좀 처럼 구체적 갈등상황에 대해서 다루지 않습니다. 나는 쎄다고, savage라고 주장하는 경우가 있으나 실제 갈등상황을 보지 못했으니 사실 단번에 믿어버리기는 조금 애매하다. 우리는 위키미키를 좀 더 자세히 살펴볼 필요가 있습니다. 위키미키 타입은 자신이 쎄다고 주장하지는 않습니다. 오히려 쿨함을 표방하는데, 사실 이들이야 말로 이 바닥 최강자일지도 모릅니다. 이들은 논쟁과 갈등을 싫어하지 않습니다. 보통은 꺼릴지도 모르는 "시크함, 까칠함, 삐딱함"에 대해서도 이들은 "I like it"이라 외치죠.`,
      `위키미키의 데뷔곡을 살펴봅시다. 내가 맘에 들어하던 상대가 연애를 하자, 다짜고짜 가서 "I don't like your girlfriend"라고 말하며, 질문 공세를 퍼붓습니다. 위키미키 유형은 말을 나오는 대로 막 뱉을 수 있는 특별한 능력을 갖고 있는데요. 특히 궁금한 것에 대해서라면 눈치도 필터도 없이 일단 뱉고 봅니다. "네 여친 싫다"는데 그치지 않고, "언제봤다고 둘이 친한 건지, 웃긴 왜 웃는지"까지 묻습니다. 썸타는 사이에 "불쑥 찾아오는 것이 맘에 들지 않는 것도, 우리 둘 맘이 같지만 뭔가 부족하다"고 느끼는 것도 다 솔직하게 이야기하는 게 위키미키 유형입니다. 그러면서도 주변 사람들의 속을 뒤집는 포인트는 정작 본인은 "날보고 첫마디가 Cool"이라며 언제나 쿨함을 유지한다는 것입니다. 그러나 사실 이들이 질문을 하는 것은 상대를 괴롭히기 위함이라기보다는, 관심의 표현임을 알아야 합니다. 위키미키 타입은 오히려 관심이 없는 사람에게는 일절 질문을 하지 않습니다.`,
      `또 위키미키 타입의 사람들은 자유분방하고, 규칙에 얽매이는 것을 좋아하지 않습니다. "내 안은 흥미로 가득찬 호기심, 모든게 즉흥적"이죠. "꽉 막힌 생각에는 바람을 통하게 take it easy"해야 마땅합니다. 이들은 필요하다면 기꺼이 "new rules"를 만들고, "무료한 머릿  속에다 불꽃들을 팡팡" 터트립니다! 이들에게는 언제나 새로운 것들에 대한 아이디어가 넘쳐납니다.`
    ]
  },
  {
    name: "OhMyGirl",
    code: "OMG",
    mbti: "ISFP",
    fitMe: {
      INFP: 5,
      ENFP: 5,
      INFJ: 5, 
      ENFJ: 1,
      INTJ: 3,
      ENTJ: 3,
      INTP: 3,
      ENTP: 3,
      ISFP: 4,
      ESFP: 4,
      ISTP: 4,
      ESTP: 4,
      ISFJ: 3,
      ESFJ: 1,
      ISTJ: 3,
      ESTJ: 1
    },
    member: [
      {
        name: "Hyojung",
        mbti: "ESFJ"
      },
      {
        name: "Mimi",
        mbti: "Unknown"
      },
      {
        name: "YooA",
        mbti: "Unknown"
      },
      {
        name: "Seunghee",
        mbti: "ENFJ"
      },
      {
        name: "Jiho",
        mbti: "Unknown"
      },
      {
        name: "Binnie",
        mbti: "ISTJ"
      },
      {
        name: "Arin",
        mbti: "INFP"
      },
    ],
    albumCover: 10,
    slogan: "사랑을 찾기 위해, 영원을 약속하는 순정파 걸그룹",
    description: [
      `<퀸덤> 이후 급부상하며 <살짝 설렜어>와 <던던댄스>로 대중성을 확보한 탓에 종종 잊곤 하지만, 오마이걸이란 기획의 핵심은 <Closer>, <비밀정원>, <다섯 번째 계절> 등으로 대변되는 "청순몽환"입니다. 오마이걸은 가까운 거리에서 또렷이 보이기 보다는 조금은 거리를 두고 보일듯 말듯 어렴풋한 인상을 주곤 하죠. 오마이걸 타입의 사람들 역시 자신만의 공간을 확보하는 것을 중요하게 생각합니다. 이들은 "어떤 이에게도 말하지 않았던 내 안에 소중한 혼자만의 장소"를 갖고 있는데요, 누군가 허락 없이 개인적인 공간을 침범하는 것을 극도로 싫어합니다. <Closer>에서도 너에게 닿기를 꿈꾸지만, 끝내 "함께였던 공간에서 날 비춰주기"만을 바랄 뿐입니다.`,
      `타인의 공간을 존중하는 오마이걸 타입은 자신의 의견을 타인에게 강요하지 않습니다. 오마이걸이 표현하고 싶은 마음이 있어도 멀리서 그저 별똥별에게, 달님에게 마음을 담아 보내 듯, 이들은 가능한 의견 충돌을 피합니다. 필요하지 않다면 자신을 적극적으로 드러내보이지도 않죠. 오마이걸의 노래에서는 "나 예뻐죽겠지?"라는 식의 흔한 K-걸그룹 가사도 찾기 힘듭니다. 자신을 내보이는데 익숙하지 않은 이들은 자연스레 혼자서 간직한 비밀이 많은 편인데, 무언가를 억지로 숨기려했다기보다는 그저 말하기 귀찮았을 가능성이 큽니다. 이런 오마이걸 타입이기에 이들이 누군가에게 "살짝 설렜어도, 넌 결코 알 리가 없는 거"겠죠.`,
      `또, 오마이걸 타입은 미래를 설계하기 보다는 현재를 즐기기를 좋아합니다. "따분했던 하루와 일상에서 벗어나"거나 "다른 시선 따위 잊고 복잡한 세상과 기대에서 벗어나"는 것은 이들이 늘 꿈꾸는 일입니다. 오마이걸 타입은 S성향을 가진 타입들 중에서는 N 성향이 강한 편인데, 이들은 예술성이 뛰어나고 탁월한 심미안을 갖고 있습니다. 어떤  상황, 물체, 사람에게서 영감을 받으면 상상력을 동원해 이를 자신만의 시각으로 재해석하곤 합니다. "유성이 비처럼 쏟아지는 하늘", "너를 생각하면 흔들리는 나무들과 너를 볼 때마다 돌아가는 바람개비" 등은 예쁜 K팝 가사로 언제나 손에 꼽힙니다.`
    ]
  },
  {
    name: "MOMOLAND",
    code: "ML",
    mbti: "ESFP",
    fitMe: {
      INFP: 5,
      ENFP: 5,
      INFJ: 5, 
      ENFJ: 5,
      INTJ: 3,
      ENTJ: 3,
      INTP: 3,
      ENTP: 3,
      ISFP: 4,
      ESFP: 4,
      ISTP: 4,
      ESTP: 4,
      ISFJ: 1,
      ESFJ: 3,
      ISTJ: 1,
      ESTJ: 3
    },
    member: [
      {
        name: "Hyebin",
        mbti: "ENFP"
      },
      {
        name: "Jane",
        mbti: "ESTJ"
      },
      {
        name: "Nayun",
        mbti: "ENFP"
      },
      {
        name: "JooE",
        mbti: "ESFP"
      },
      {
        name: "Ahin",
        mbti: "Unknown"
      },
      {
        name: "Nancy",
        mbti: "Unknown"
      },
    ],
    albumCover: 10,
    slogan: "사랑을 찾기 위해, 영원을 약속하는 순정파 걸그룹",
    percent: 12,
    description: [
      `뿜뿜, 뱀, 짠쿵쾅... 진지하게 가사를 살피지 않아도 제목만으로 모모랜드는 어떤 그룹보다 확실한 인상을 전달합니다. 여러 차례 컴백에도 저 세상 텐션을 유지한 모모랜드. 이들은 다른 아이돌 그룹과 달리 좀처럼 자신의 내면으로 빠져들지 않습니다. 내면으로 빠져들기보다는 순간의 흥분되는 감정이나 상황을 즐기죠. 진지함이나 우울함 대신 "정신 없이 쿵쿵, 내 마음을 뿜뿜"을 택합니다.`,
      `감탄사로 점철된 가사 속에서 유의미한 메시지를 찾을 수 있다면 그건, "내 사랑 너무 어마어마 해, 그대가 있어서 말야 걸을 수 있어"라는 것입니다. 모모랜드 타입은 자신의 높은 텐션을 활용해 타인을 위로하고 용기를 북돋아주는 것을 즐깁니다. "정신없이 hit it hit it hit it"하는 와중에도 "네 어깨 무릎 발"을 읊어대며 상대에 대한 칭찬을 아끼지 않습니다. "이건 시험이 아냐 지금은 베껴도 돼"부터 시작해서 "땡땡이 치고 날 만나게 될 것"까지, 학창시절 문제아였을 것만 같은 이들이 매력덩어리가 될 수 있었던 게 다 그 때문입니다.  "빛이나, 난리나, I'm so hot"을 연발해도 밉지가 않습니다. "내게 홀리게 될 것"이라 장담해도 그러려니 하죠. 모모랜드 타입은 상대의 매력을 잘 발견하는 만큼, 스스로의 매력도 잘 알고 있습니다.`,
      `모모랜드 타입은 미래를 차분히 준비하는 것을 어려워 합니다. "tick tock 시간 없어 움직여 your body, 뒤쳐지지 않아 벌써 지치면 안돼." 누가보면 워커홀릭인 줄 알겠지만, 이는 한 번 뿐인 오늘 다같이 춤을 추는 이들의 자세입니다. 모모랜드의 노래만 듣더라도 나중을 위해 남겨둔 여백을 찾기 힘듭니다. 이들은 막연한 무언가를 쫓기보다는 재밌고 기발한 것들에 초점을 맞춥니다. 그러나  즐거움은 언젠가 소진되기 마련이므로, 모모랜드 타입의 주변인들은 어딘가 좀 허무하다고 느낄지도 모르겠네요. 그럼에도 순간을 강렬하게 즐길 줄 아는 이들과 함께 한 시간은 쉽게 잊혀지지 않을 것입니다.`
    ]
  },
  {
    name: "BlackPink",
    code: "BP",
    mbti: "ISTP",
    fitMe: {
      INFP: 5,
      ENFP: 5,
      INFJ: 5, 
      ENFJ: 5,
      INTJ: 3,
      ENTJ: 3,
      INTP: 3,
      ENTP: 3,
      ISFP: 4,
      ESFP: 4,
      ISTP: 4,
      ESTP: 4,
      ISFJ: 3,
      ESFJ: 1,
      ISTJ: 3,
      ESTJ: 1
    },
    member: [
      {
        name: "Jisoo",
        mbti: "ESTJ"
      },
      {
        name: "Jennie",
        mbti: "INFP"
      },
      {
        name: "Rosé",
        mbti: "ENFP"
      },
      {
        name: "Lisa",
        mbti: "ESFJ"
      },
    ],
    albumCover: 7,
    slogan: "사랑을 찾기 위해, 영원을 약속하는 순정파 걸그룹",
    percent: 12,
    description: [
      `<pretty savage>를 자처하는 블랙핑크. 블랙핑크 타입의 사람들은 용감하고 저돌적이며, 첫인상이 차갑고 다가가기 어렵습니다. 이들은 효율을 따지는 것을 좋아하는데, 정서적인 표현도 때론 효율을 따진다. "쉽게 웃어주는 건 날 위한 것"이라는 대목은 흔히 볼 수 있는 가사가 아닙니다. 그래서 이들은 감정 없는 로봇처럼 보이기도 한다. "감정의 노예가 되는 것을 딱하다"고 생각하기도 하며, "과감히 사랑의 숨통을 끊겠다"고도 하니 냉혈안처럼 생각되는 것도 가능한 일이긴 합니다.`,
      `블랙핑크 타입의 사람들에게 자신의 감정을 속이며 "흔한 남들처럼 착한 척" 하는 건 초고난도의 일입니다. 동시에 이들은  남들의 의도적인 감정표현에 대해서도 금방 간파합니다. 그래서인지 블랙핑크는 상대의 착각에 대해 자신있게 말할 수 있습니다. "나를 가질 수 있을 거란 너의 생각도 착각"이고, "쉽게 웃어주는 게 널 위한 것이란 생각도 착각"이라 말하죠. 모쪼록 블랙핑크 타입의 상사에게라면 아부 같은 건 그닥 효과가 없을 것입니다. 또한 블랙핑크 타입은 타인의 속마음을 읽으면서도 "굳이 눈치 보지 않습니다." 이런 모습은 자신감 있는 모습으로 비춰지기도 하지만, 좀 예의 없거나, 자의식이 과잉되어 있는듯 보이기도 합니다. (자신의 그룹이름을 노래에서 그토록 많이 호명하고 활용하는 경우도 사실 흔치는 않죠.)`,
      `블랙핑크 타입의 사람들이 감정이 없다고 느낄 수 있지만, 이들과 가까워지고 나면 이야기가 달라집니다. 이들은 감정을 어떻게 다루고 표현해야 할지 빠르게 확신이 서지 않아 단지 감정을 표현하지 않고 숨기고 보호하는 것에 가깝습니다. 이들 역시 사람이기에 강한 감정을 느끼기 마련이죠. 감정을 다루는 것에 익숙하지 않은 이들은 "넌 뭔데 자꾸 생각나냐며, 자존심 상해"하며 당황하곤 합니다. 그러나 곧 상황과 사람에 익숙해지고 나면, "불붙은 심장에 기름을 부으라"고 말하기도 하며, "너란 세상에 내 전부를 던지는 불장난"을 감행하기도 합니다.`,
      `그러나 무엇보다 사실 yg 아티스트들이 종종 그래왔듯 블랙핑크 역시 가사, 혹은 메시지를 통해 무언가를 전달하기보다는 센스있는 음악 자체로 승부를 보는 경향이 있습습니다. 블랙핑크 타입의 사람들 역시 감각을 사용해 즐거움을 느끼는데 탁월합니다. 이들은 무언가를 직접 감상하고 느끼면서 세상을 탐색하는 것을 좋아하죠. 이들은 직관보다는 감각에 익숙합니다. "날 사랑한다면 심장을 도려내 보여봐"라는 가사는 블랙핑크여야 가능한 가사가 아닐까요.`
    ]
  },  
  {
    name: "RedVelvet",
    code: "RV",
    mbti: "ESTP",
    fitMe: {
      INFP: 5,
      ENFP: 5,
      INFJ: 5, 
      ENFJ: 5,
      INTJ: 3,
      ENTJ: 3,
      INTP: 3,
      ENTP: 3,
      ISFP: 4,
      ESFP: 4,
      ISTP: 4,
      ESTP: 4,
      ISFJ: 1,
      ESFJ: 3,
      ISTJ: 1,
      ESTJ: 3
    },
    member: [
      {
        name: "Irene",
        mbti: "ENTJ"
      },
      {
        name: "Seulgi",
        mbti: "ISFP"
      },
      {
        name: "Wendy",
        mbti: "ISFP"
      },
      {
        name: "Joy",
        mbti: "INFP"
      },
      {
        name: "Yeri",
        mbti: "INFP"
      }
    ],
    albumCover: 15,
    slogan: "사랑을 찾기 위해, 영원을 약속하는 순정파 걸그룹",
    percent: 12,
    description: [
      `"경고 먹기 싫다면 쿵푸만큼 빠르게 버튼을 누르고 블랑카처럼 돌진/롤링"하는 게 좋을 겁니다. 레드벨벳 타입에게 인생은 하나의 커다란 게임입니다. "한방에 멋진 일을 straight up", 위험을 감수할 줄도 알고 스릴과 모험을 즐기는 이들은 k팝-승부사입니다. 도입부만 얼핏 보면 이들도 사랑에 빠져 마냥 어쩔 줄 몰라하는 듯 보입니다. 그러나 이들은 언제나 상황을 역전시키고 맙니다. "사랑은 쉽게 즐기는 가벼움일 뿐이라 못된 얘기"만 늘어놓던 너에게 휘둘리는 듯하다, 결국 "love is game이라고 말은 해도 어쩔 줄 몰라하는 널" 만들고야 맙니다. 역전 레퍼토리는 bad boy에서도 반복되죠. "외면하려해도 네게 끌리던 나"였지만, 곧 "상황은 좀 달라져, (넌) 주위를 맴도는 내가 궁금해"지게 됩니다. 끝내 "사실 꽤나 자신 있어 난, 지는 게임 하지 않아"라고 쐐기를 박습니다.`,
      `그 어떤 유형보다 감각이 잘 발달한 레드벨벳 타입의 사람들은 머릿 속으로 복잡한 생각을 이어나가는 것보다는 무엇이든 직접 경험하는 편을 선호합니다. "네모난 지구 위로 걱정은 집어 던지고, 해보고 싶음 그냥 하고" 맙니다. "녹아버리기 전에 진하고 강렬한 너의 색으로 물들여달라고, 저 달이 정글짐에 걸릴 시간까지 놀아보자"고 말합니다. 흥미와 재미를 추구하며 사는 이들은 사실 진지해지는 것을 힘들어하기도 합니다. 물론 게임도 좋지만 언제나 "쥐락펴락하고 새것만 좋아하는 사랑"을 한다면, 상대가 이들을 잘 견뎌줄 수 없을지도 모릅니다.`,
      `그러나 이들이 엄청난 승부욕에 불타, 승리에 집착하는 것은 아닙니다. 이들은 유독 사람을 상대로는 말랑말랑한 편입니다. 누군가 자신에게 실수를 하더라도 봐주고 넘어가거나 제대로 한 번 싸우고 나면 뒤끝은 전혀 없죠. 그렇기에 "매섭게 발로 차도 미소짓는 널 어떻게 놓겠냐"고 한 게 아닐까요. 때론 공감능력이 조금 부족한 부분만 이해한다면 이들의 자신감 넘치는 모습은 언제나 매력적입니다. "괜찮다면 널 내가 길들여볼게, 있는 힘껏 나빠져봐!", "경고하는데 조심해야 돼, 여럿봤는데, 못 나오던데"와 같은 말들, 확실히 k팝 걸그룹들에게선 쉬이 볼 수 있는 매력이 아닙니다.`
    ]
  },  
  {
    name: "Lovelyz",
    code: "LV",
    mbti: "ISFJ",
    fitMe: {
      INFP: 5,
      ENFP: 5,
      INFJ: 5, 
      ENFJ: 5,
      INTJ: 4,
      ENTJ: 3,
      INTP: 4,
      ENTP: 4,
      ISFP: 3,
      ESFP: 1,
      ISTP: 3,
      ESTP: 1,
      ISFJ: 4,
      ESFJ: 4,
      ISTJ: 4,
      ESTJ: 4
    },
    member: [
      {
        name: "Baby Soul",
        mbti: "ENTJ"
      },
      {
        name: "Jiae",
        mbti: "ISFP"
      },
      {
        name: "Jisoo",
        mbti: "ENFP"
      },
      {
        name: "Mijoo",
        mbti: "ISFP"
      },
      {
        name: "Kei",
        mbti: "Unknown"
      },
      {
        name: "Jin",
        mbti: "Unknown"
      },
      {
        name: "Sujeong",
        mbti: "INFJ"
      },
      {
        name: "Yein",
        mbti: "Unknown"
      },
    ],
    albumCover: 13,
    slogan: "사랑을 찾기 위해, 영원을 약속하는 순정파 걸그룹",
    percent: 12,
    description: [
      `러블리즈에 대해 잘 모르는 사람은 있어도, <Ah-Choo>를 이야기하면 대체로 고개를 끄덕입니다. "널 보면 재채기가 나올 것 같아"를 그냥 좀 우스운 가사라고 생각할 수도 있지만, 이는 참다 못해 터져나온 수줍은 마음을 표현합니다. "네게 하고 싶은 말은 점점 많아지고, 입술이 간질간질 하다 터져나온 것"이 재채기라는 이야기죠. 대형 기획사 그룹들의 큰 임팩트에 가끔 잊지만, 사실 3세대 아이돌 사이에서 불었던 청순 컨셉의 원본은 러블리즈라 해도 과언이 아닙니다. 러블리즈는 수줍고, 두근두근한 소녀의 마음을 그 어떤 그룹보다 탁월하게 표현합니다.`,
      `러블리즈 타입의 사람들은 감성적이지만, 다른 사람들은 이들이 감성적이라는 걸 쉬이 알아채지 못하는 경우가 많습니다. 이들은 인내심이 강하고, 느끼는 것에 비해 감정을 드러내는데 있어서는 조심스러운 편입니다. "누군가 지쳐보이면 내가 더 슬퍼질" 만큼 공감능력이 뛰어나고 감수성이 풍부하면서도, 남들 앞에서는 잘 울지 않죠. 누군가를 좋아해도 이들은 "섣불리 사랑을 고백을 하기보다는 밤새 쓰다만 편지"에 마음을 담습니다. 이별의 현장에서도 (여자)아이들은 감정을 폭발적으로 드러내는 한 편, 러블리즈는 "기억 속 너를 삼키기"를 선택합니다. 그래서 러블리즈 타입의 짝사랑은 유독 좀 더 서글픕니다. "다쳐가는 걸 알면서도 저려오도록" 짝사랑을 하죠. 이렇게 러블리즈 타입의 사람들은 감정을 억눌러두는데, 그러다 가끔 참았던 감정들이 터져나오곤 합니다. <Ah-Choo>처럼요.`,
      `러블리즈 타입의 사람들은 조심스럽기 때문에 관계의 초반에는 자기 자신을 많이 드러내지 않습니다. 그러나 특정 사람과 공동체에 익숙해져 안정적인 관계를 구축하고나면, 주변 사람들을 돕는 것에서 보람을 느낍니다. 러블리즈는 좋아하는 사람이 생기면, "맛있는 걸 해주고 싶어 요리를 연습하고, 해주고픈 말들도 많아집니다." 또 필요하다면 "내가 거기 있어줄게"라고 약속합니다. 만일 이들과 좋은 관계를 유지하고 싶다면 이들의 헌신에 꼭 사랑과 감사로 보답하기 바랍니다. 이들은 "힘들 때 그대 마음 한 스푼이면 오늘 하루도 웃을 수 있는 사람들"입니다. 그러나 이들의 헌신을 "기억"해주지 않는다면, 이들은 당신과의 관계를 다시 생각해 볼지도 모릅니다. 세심하고 꼼꼼한 이들은 기억력이 좋다는 사실과 싫어하는 사람에게는 거칠고 매정하다는 사실을 잊어서는 안 됩니다.`
    ]
  },  
  {
    name: "WJSN",
    code: "WJSN",
    mbti: "ESFJ",
    fitMe: {
      INFP: 5,
      ENFP: 5,
      INFJ: 5, 
      ENFJ: 5,
      INTJ: 4,
      ENTJ: 3,
      INTP: 4,
      ENTP: 4,
      ISFP: 1,
      ESFP: 3,
      ISTP: 1,
      ESTP: 3,
      ISFJ: 4,
      ESFJ: 4,
      ISTJ: 4,
      ESTJ: 4
    },
    member: [
      {
        name: "Exy",
        mbti: "ESFP"
      },
      {
        name: "Seola",
        mbti: "INFP"
      },
      {
        name: "Bona",
        mbti: "INFP"
      },
      {
        name: "Soobin",
        mbti: "ENFP"
      },
      {
        name: "Luda",
        mbti: "ISFJ"
      },
      {
        name: "Dawon",
        mbti: "INFP"
      },
      {
        name: "Eunseo",
        mbti: "ENFJ"
      },
      {
        name: "Yeoreum",
        mbti: "ESFJ"
      },
      {
        name: "Dayoung",
        mbti: "ESFJ"
      },
      {
        name: "Yeonjung",
        mbti: "ESTP"
      },
    ],
    albumCover: 11,
    slogan: "사랑을 찾기 위해, 영원을 약속하는 순정파 걸그룹",
    percent: 12,
    description: [
      `천사표 아이돌이라고 다 같은 천사가 아닙니다. 우주소녀는 큐피드 같은 아기천사가 아니라, 거의 홀리엔젤몬에 가까운 수호천사입니다. 어떤 K팝 걸그룹이 "얘기해줘", "들려줘"라고 말할 때, 대부분의 경우 이는 사랑을 속삭여달라는 말이죠. 그러나 우주소녀는 달콤한 사랑의 속삭임을 듣기위해 너의 얘길 들려달라는 것이 아닙니다. 우주소녀는 "내가 여린 널 지켜주고, 또 네 편이 되어 이끌어줄테니, 너의 이야기를 들려달라"고 합니다. "조금씩 가까워져 감싸 안고서 나와 나의 귓가에 맴도는 말"은 love me, love you가 아니라, "save me, save you"였습니다. 이들이 부탁까지 해가며, 네 얘길 들려달라고 한 데에는 다 이유가 있었던 거죠.`,
      `우주소녀 타입은 신뢰와 인정을 받는 한 다른 사람들을 돕기 위해 무엇이든 합니다. "날 믿어주고 용기를 준다면, 안 되는 것도 되게" 하는 것이 이들입니다. 앞서 이야기했지만, 우수소녀의 "말해줘"는 내가 듣고 싶은 말을 네가 해줘, 가 아니라, "네가 말하고 싶은 걸 나에겐 말해, 들어줄게!"에 가깝습니다. 이들은 다른 사람들의 필요에 민감하며,  타인을 도우면서 큰 행복을 느낍니다. 우주소녀 타입은 모든 유형 중 가장 외향성이 강한 타입 중 하나입니다. 이들에게는 "너와 내가 타인이 되어 서로 그저 스쳐지나가는 것은 아찔한 상상"에서나 가능한 일입니다. 시스타의 후배답게 거의 모든 노랫말이 혼잣말보다는 구체적인 상대에게 건네는 말들로 구성되어 있습니다.`,
      `우주소녀 타입은 꼭 돕기 위해서뿐 아니라 기본적으로 다른 유형에 비해 다른 사람들의 시선을 많이 의식합니다. 같이 다니는 친구들이 어떤지 묻는가 하면, 누군가 "멋지다 해주면 기쁘고, 허벅지 좀 쪘다하면 어딜가도 자신이 없어"집니다. 이들은 사회의 규칙과 전통에도 빠식한데, 연애를 할 때에도 자신의 맘이 그렇지가 않아도, 남들이 그렇다고 하니 "날 함부로 대할까 센 척도 해보고, 밀고 당기기"도 해봅니다.`,
      `그야말로 수퍼 E, 수퍼인싸인 이들은 남들을 돕기 위해서라면 자신의 원칙을 져버리기도 합니다. 남들을 돕는 것 자체가 자신의 원칙이기 때문이겠죠. 아닌 건 아니라 칼 같이 말하는 아이돌그룹들이 있는 한 편, 이들은 "너의 편이 되기 위해 우리 서로 몰랐던 지나쳤던 시간은 모른 척 눈감아주기"도 합니다. 그런 이들이 건강하지 않은 상태에 있을 때는 꾸준히 쌓아온 남들과의 유대를 자신의 권력으로 이용하는 경우도 있습니다. 이럴 때면, 이들은 "딴데 가서는 비밀 너랑 나랑만!"이라며 가십거리를 만들기도 합니다. 그러나 기본적으로 신경성이 낮아 부정적인 감정을 웬만해선 느끼지 않는 이들이기에, 평범한 일상에서라면 남들에게 잘 공감하는 긍정적인 모습일 것입니다.`
    ]
  },  
  {
    name: "LOONA",
    code: "LN",
    mbti: "ISTJ",
    fitMe: {
      INFP: 5,
      ENFP: 5,
      INFJ: 5, 
      ENFJ: 5,
      INTJ: 4,
      ENTJ: 3,
      INTP: 4,
      ENTP: 4,
      ISFP: 3,
      ESFP: 1,
      ISTP: 3,
      ESTP: 1,
      ISFJ: 4,
      ESFJ: 4,
      ISTJ: 4,
      ESTJ: 4
    },
    member: [
      {
        name: "Haseul",
        mbti: "Unknown"
      },
      {
        name: "Vivi",
        mbti: "Unknown"
      },
      {
        name: "Yves",
        mbti: "INFJ"
      },
      {
        name: "JinSoul",
        mbti: "ISFJ"
      },
      {
        name: "Kim Lip",
        mbti: "ESTJ"
      },
      {
        name: "Chuu",
        mbti: "ENTP"
      },
      {
        name: "Heejin",
        mbti: "ENTJ"
      },
      {
        name: "Hyunjin",
        mbti: "ESFJ"
      },
      {
        name: "Go Won",
        mbti: "INFP"
      },
      {
        name: "Choerry",
        mbti: "ENFP"
      },
      {
        name: "Olivia Hye",
        mbti: "ISTP"
      },
      {
        name: "Yeojin",
        mbti: ""
      },
    ],
    albumCover: 5,
    slogan: "사랑을 찾기 위해, 영원을 약속하는 순정파 걸그룹",
    percent: 12,
    description: [
      `f(x)의 뒤를 이을 이과돌을 뽑아야 한다면, 이달의 소녀를 꼽겠습니다. 열두달에 걸쳐 한 명씩 멤버를 소개하는 컨셉에 걸맞게 가사에 "12개의 다른 문", "4번째 계절이 바뀌었지" 등 숫자가 자주 등장하는 것은 물론, 12명의 멤버중 네 명으로 구성된 유닛 그룹의 이름을 "이달의 소녀 1/3"이라고 짓기도 한 바 있습니다. 이들은 "O 아님 X" 혹은 "Tic Tac Toe" 처럼 명확한 답이 있는 것을 편안하게 느낍니다. 나를 한 마디로 정의할 순 없다거나 하는 모호한 이야기를 하지도 않습니다. 오히려 이들은 "어떤 단어로 정의할까, 너를 설명할 언어를 알려줄래?"라고 요구하거나, "너를 본 순간 모든 게 설명이 돼"라고 말합니다. 정말이지 사랑을 수능에 비유하는 것은 이달소여서 가능했던 게 아닐까 생각해봅니다.`,
      `"너도 알지, 꿈이 아니야!"라고 말하는 이달의 소녀 타입은 현실적입니다. 합리적이고 논리적인 것을 추구하는 이들은 여느 k팝 걸그룹처럼 "자유로워지자"고 이야기하는 와중에도 "넘어선 안 될 선은 지키지", "난 내 중심을 지킬 뿐이지"라고 못박죠. 이들은 공동체의 전통과 질서를 중시하고 맡은 바 임무를 수행하는데 탁월합니다. "are you ready for some action, 시작된 우리의 미션"을 보면, 이들은 책임감을 확인할 수 있습니다. 만일 회의 자리에서 누군가  이들에게 주제에서 벗어난 TMI를 늘어놓는다면, "길게도 blah blah blah"라는 이달의 소녀 타입의 혼잣말을 들을지도 모릅니다.`,
      `이렇게 현실에 발 붙인 이과돌 이달의 소녀 타입은 공대 아름이 보다는 차라리 헤르미온느에 가깝습니다. 이들은 겉보기에 차가워보인다는 말을 종종 듣습니다. 본인이 합리적이라 판단한다면, "가시 돋치고, 얼음 같고, 겁이 없어 보이는 것"에 대해서도 게의치 않고 "so what?"이라 되묻습니다. 심지어 이들은 연애를 할 때도 이성과 감정을 잘 분리합니다. 썸을 타면서 "니가 날 보는 걸 알아도 계속 널 놀리고 싶다"고 하죠. 이들은 혼자가 되는 것에 대해 다른 유형과 비교해 불안감이 덜합니다. 때문에 "세상에 없던 이기적인 나야", 라고 말하는데에도 거리낌이 없습니다.`
    ]
  },  
  {
    name: "AESPA",
    code: "AE",
    mbti: "ESTJ",
    fitMe: {
      INFP: 5,
      ENFP: 5,
      INFJ: 5, 
      ENFJ: 5,
      INTJ: 4,
      ENTJ: 3,
      INTP: 1,
      ENTP: 4,
      ISFP: 1,
      ESFP: 3,
      ISTP: 1,
      ESTP: 3,
      ISFJ: 4,
      ESFJ: 4,
      ISTJ: 4,
      ESTJ: 4
    },
    member: [
      {
        name: "Karina",
        mbti: "Unknown"
      },
      {
        name: "Giselle",
        mbti: "Unknown"
      },
      {
        name: "Winter",
        mbti: "Unknown"
      },
      {
        name: "Ningning",
        mbti: "Unknown"
      },
    ],
    albumCover: 3,
    slogan: "사랑을 찾기 위해, 영원을 약속하는 순정파 걸그룹",
    percent: 12,
    description: [
      `보통은 지루한 일상에서 벗어나는게 취미인 K팝 아이돌인데, 에스파는 "절대적 룰을 지킬 것"을 요구합니다. 에스파 타입의 사람들은 체계적이고 계획적이며, 원리원칙과 규범을 중시합니다. 에스파의 세계관에는 명확히 지켜야 할 것들이 있습니다. "절대로 뒤를 돌아보지 말고, 광야의 것을 탐내지 말고." 마치 성경에 등장하는 율법을 연상시키는 이 가사들 뒤에는 "약속이 깨지면 모두 걷잡을 수 없게 된다"는 경고까지 따릅니다. 에스파 타입은 "real world(현실)"로부터 탈출할 것이 아니라, 현실에 발을 붙이고 이것을 어떻게 헤쳐나갈지에  주관심이 모여있습니다.`,
      `에스파 타입은 도전정신이 강하고 승부욕이 강합니다. 위기 상황에 강한 정신력을 드러내는 것은 에스파 타입이 가진 장점입니다. "블랙맘바가 널 유혹해 삼키자 이들에게 분신을 되찾으리라"는 본격적인 미션이 생기고, "신호가 불안해져가자 블랙맘바를 파괴하고 말 것"이라는 목적의식이 생깁니다. 에스파 타입은 이런 강한 정신력과 승부욕으로 자신이 지켜야 할 사람들을 지킵니다. "맞잡은 손을 절대 놓치지 않겠다고 말하며, 너와 연결될 수 있다면 위협에 맞서 아무튼 다 제끼고" 보는게 에스파 타입입니다.`,
      `이렇게 강한 에스파 타입에게도 단점이 존재합니다. 불도저 같은 에스파타입은 남들이 보기에 공감능력이 부족하고, 냉혈안처럼 보일 수 있습니다. "에스파는 나야 절대 둘이 될 수 없다"고 이야기하는 모습을 보면 어딘지 자의식 과잉처럼 보이기도 합니다. 이들은 언제나 냉철한 판단을 합니다. 선한 가치를 쫓는 아이즈원 타입이나, 여자친구 타입과는 달리 이들은 "선함만으로는 너의 위대함을 이기지 못한다"고 냉철한 판단을 내립니다. 적대적 고난과 슬픔도 이들은 기꺼이 팝핀-진화의 자양분으로 삼습니다. 또한 "'감정'이란 것은 이들에게 배워야 할 대상"이죠. 그러나 이들이 자신이 속한 공동체와 타인들을 신경쓰지 않는 것은 아닙니다. 이들은 언제나 "결속"을 이야기하고 "너와 나의 연결"을 목표로 삼습니다. 이들은 어쩌면 누구보다 공동체를 신경쓰는 걸지도 모릅니다. 공동체를 케어하는 방식이 조금 다를 뿐이지요.`
    ]
  },

];

export default groupsArr;